In [2]:
#Improts 

import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)
import sqlite3
#import matplotlib.pyplot as plt

In [3]:
# get the database path 
database = 'database.sqlite'

In [4]:
# create a connection object using the sqlite3 API 
conn = sqlite3.connect(database)

In [5]:
# use Pandas to read data from the Database 
tables = pd.read_sql("""SELECT *
                        FROM sqlite_master
                        WHERE type='table';""", conn)

In [12]:
print(pd.read_sql("""select distinct name from Country """,conn))

           name
0       Belgium
1       England
2        France
3       Germany
4         Italy
5   Netherlands
6        Poland
7      Portugal
8      Scotland
9         Spain
10  Switzerland

In [13]:
print(pd.read_sql("""select distinct team_long_name from Team """,conn))

         team_long_name
0              KRC Genk
1          Beerschot AC
2      SV Zulte-Waregem
3      Sporting Lokeren
4     KSV Cercle Brugge
..                  ...
291       FC St. Gallen
292             FC Thun
293         Servette FC
294  FC Lausanne-Sports
295              Lugano

[296 rows x 1 columns]

In [14]:
pd.read_sql("""select distinct name from League """,conn)

                        name
0     Belgium Jupiler League
1     England Premier League
2             France Ligue 1
3      Germany 1. Bundesliga
4              Italy Serie A
5     Netherlands Eredivisie
6         Poland Ekstraklasa
7   Portugal Liga ZON Sagres
8    Scotland Premier League
9            Spain LIGA BBVA
10  Switzerland Super League

In [15]:
print(pd.read_sql("""select distinct player_name from Player""",conn))

               player_name
0       Aaron Appindangoye
1          Aaron Cresswell
2              Aaron Doran
3            Aaron Galindo
4             Aaron Hughes
...                    ...
10843       Zoumana Camara
10844         Zsolt Laczko
10845            Zsolt Low
10846  Zurab Khizanishvili
10847   Zvjezdan Misimovic

[10848 rows x 1 columns]

In [25]:
def leg(coun):
    df = pd.read_sql(f"""select name from League where id = (select id from Country where name = '{coun}') """,conn)
    return df

leg("England")

                     name
0  England Premier League

In [26]:
leg("England")

                     name
0  England Premier League